{
  "products": [
    {
      "name": "Samsung Galaxy S24 Ultra",
      "imgSrc": "/1.png",
      "description": "Флагманский смартфон с мощным процессором Exynos 2400, камерой 200 Мп и батареей 5000 мАч.",
      "fullDescription": "📱 Samsung Galaxy S24 Ultra — флагман нового поколения\nSamsung Galaxy S24 Ultra — это воплощение мощности, инноваций и премиального дизайна. Смартфон, способный удовлетворить запросы даже самых требовательных пользователей, предлагая непревзойдённую производительность, выдающуюся камеру и расширенные возможности искусственного интеллекта.\n\n🔧 Технические характеристики\nДисплей:\n6.8-дюймовый Dynamic AMOLED 2X с разрешением QHD+ (3088 x 1440), адаптивная частота обновления от 1 до 120 Гц, HDR10+, защита Gorilla Glass Armor\n\nПроцессор:\nQualcomm Snapdragon 8 Gen 3 for Galaxy — специально оптимизированная версия чипа для максимальной производительности\n\nОперативная память:\n12 ГБ LPDDR5X\n\nВстроенная память:\n256 ГБ / 512 ГБ / 1 ТБ UFS 4.0\n\nОперационная система:\nOne UI 6.1 на базе Android 14\n\n📸 Камера\nGalaxy S24 Ultra оснащён одной из самых продвинутых систем мобильной съёмки на рынке:\n\nОсновная камера: 200 Мп (f/1.7, OIS)\n\nПерископ: 50 Мп с 5-кратным оптическим зумом\n\nТелеобъектив: 10 Мп с 3-кратным оптическим зумом\n\nУльтраширик: 12 Мп (f/2.2, 120°)\n\nФронтальная камера: 12 Мп с поддержкой 4K и автофокусом\n\n📷 Поддержка съёмки в RAW, ночной режим, портреты с эффектом боке, съёмка видео в 8K при 30 кадрах в секунду и интеллектуальная постобработка на базе Galaxy AI.\n\n🤖 Galaxy AI — искусственный интеллект нового уровня\nСерия S24 активно интегрирует Galaxy AI:\n\n📞 Live Translate — мгновенный перевод звонков в реальном времени\n\n✍️ Note Assist — автоматическое структурирование и суммирование заметок\n\n🌐 Browsing Assist — резюме веб-страниц\n\n🖼️ Generative Edit — интеллектуальное редактирование фотографий (удаление объектов, замена фона и т.д.)\n\n🔋 Аккумулятор и зарядка\nЁмкость: 5000 мАч\n\nБыстрая зарядка: 45 Вт (50% за ~20 минут)\n\nБеспроводная зарядка: 15 Вт\n\nОбратная зарядка: Wireless PowerShare\n\n✏️ S Pen\nGalaxy S24 Ultra остаётся единственным в серии S с поддержкой встроенного стилуса S Pen. Это инструмент для заметок, рисования, навигации, выделения текста и управления презентациями.\n\n🌐 Подключение\n5G, Wi-Fi 7, Bluetooth 5.3, NFC, UWB\n\nПоддержка eSIM и Dual SIM\n\nЗащита от воды и пыли по стандарту IP68\n\n📦 Комплектация\nСмартфон Galaxy S24 Ultra\n\nСтилус S Pen\n\nКабель USB-C\n\nДокументация\n\n(Блок питания продаётся отдельно)\n\n💬 Заключение\nSamsung Galaxy S24 Ultra — это мощный, умный и универсальный смартфон, созданный для тех, кто хочет максимум: будь то работа, творчество, мобильная фотография или развлечения. Его не зря называют самым «прокачанным» Android-смартфоном 2024 года."
    },
    {
      "name": "Apple iPhone 15 Pro",
      "imgSrc": "/2.png",
      "description": "Премиум-смартфон от Apple с чипом A17 Pro, титановой рамкой и улучшенной камерой для портретов."
    },
    {
      "name": "Google Pixel 8",
      "imgSrc": "/3.png",
      "description": "Чистый Android и мощная камера с поддержкой ИИ — идеальный выбор для любителей фото и простоты."
    },
    {
      "name": "Xiaomi 14 Pro",
      "imgSrc": "/4.png",
      "description": "Флагман Xiaomi с AMOLED экраном 2K, процессором Snapdragon 8 Gen 3 и быстрой зарядкой 120 Вт."
    },
    {
      "name": "OnePlus 12",
      "imgSrc": "/5.png",
      "description": "Сбалансированный смартфон с 6.8'' дисплеем, до 16 ГБ ОЗУ и суперплавной работой системы."
    },
    {
      "name": "Sony Xperia 1 VI",
      "imgSrc": "/6.png",
      "description": "Флагман для фанатов мультимедиа: дисплей 4K OLED, кинематографическая камера и звук высокого качества."
    },
    {
      "name": "Realme GT 6 Pro",
      "imgSrc": "/7.png",
      "description": "Игровой монстр с чипом Snapdragon и экраном с частотой 144 Гц для максимального погружения."
    },
    {
      "name": "Motorola Edge 50 Ultra",
      "imgSrc": "/8.png",
      "description": "Элегантный дизайн, мощное железо и быстрая зарядка — отличный выбор для современного пользователя."
    },
    {
      "name": "Asus ROG Phone 8",
      "description": "Игровой смартфон с активным охлаждением, ультрабыстрым откликом и RGB-подсветкой."
    },
    {
      "name": "Nothing Phone (2)",
      "description": "Уникальный дизайн с подсветкой Glyph, чистый Android и производительность на уровне флагмана."
    }
  ]
}