import { Typography } from "@mui/material";
import { Header } from "@/components/Header";
import { HEADER_MENU_LINKS } from "@/constants/portal-data.const";
import { Separator } from "@/components/Separator";

export default function AboutPage() {
  return (
    <main className="taAboutPage">
      <Header menu={HEADER_MENU_LINKS} />
      <Separator />
      <Typography>О компании</Typography>
      <Typography>
        Наша компания — это команда профессионалов, объединённых общей целью: создавать современные
        и эффективные решения для бизнеса. Мы специализируемся на разработке цифровых продуктов,
        автоматизации процессов и внедрении инновационных технологий, чтобы помогать нашим клиентам
        расти и достигать амбициозных целей. С момента основания мы успешно реализовали десятки
        проектов в различных отраслях: от электронной коммерции и логистики до финансов и
        образования. Индивидуальный подход, глубокое понимание задач заказчика и высокая техническая
        экспертиза позволяют нам предлагать не просто услуги, а стратегические партнёрства. Мы верим
        в силу технологий, прозрачность процессов и долгосрочное сотрудничество. Если тебе нужно
        описание под конкретную сферу (например, IT-компания, строительная фирма, маркетинговое
        агентство и т.п.) — напиши, я адаптирую.
      </Typography>
    </main>
  );
}
